"use strict";

/*
Необязательное задание.
Если вам показалось домашнее задание простым, выполняем данный пункт.

Необходимо от пользователя получить целое число.
Необходимо вывести разряды числа, а именно: количество сотен, десятков и единиц.

Пример:
Пользователь ввел число 163. Программа должна вывести:
"В числе 163 количество сотен: 1, десятков: 6, единиц: 3"

Пример 2:
Пользователь ввел число 74. Программа должна вывести:
"В числе 74 количество сотен: 0, десятков: 7, единиц: 4"

Пример 3:
Пользователь ввел число 9537. Программа должна вывести:
"В числе 9537 количество сотен: 5, десятков: 3, единиц: 7"

Уточнение: Пользователь всегда вводит корректное положительное целое число.
Подсказка: Возможно, вам понадобится округление чисел и оператор %.
*/

const needNum = Number.parseInt(prompt("Введите целое число: "));

const unit = needNum % 10;
const ten = Number.parseInt((needNum / 10) % 10);
const hundred = Number.parseInt((needNum / 100) % 10);

alert(`В числе ${needNum} количество сотен: ${hundred}, десятков: ${ten}, единиц: ${unit}`);


// ===== сначала так написал

// if (needNum < 99) {
//     alert(`В числе ${needNum} количество сотен: 0, десятков: ${ten}, единиц: ${unit}`);
// } else if (needNum < 10) {
//     alert(`В числе ${needNum} количество сотен: 0, десятков: 0, единиц: ${unit}`);
// } else {
//     alert(`В числе ${needNum} количество сотен: ${hundred}, десятков: ${ten}, единиц: ${unit}`);
// }